embedded-office/uc-can/Drivers/RX200/drv_can_reg.h
/*
*********************************************************************************************************
*                                              uC/CAN
*                                      The Embedded CAN suite
*
*                 Copyright by Embedded Office GmbH & Co. KG www.embedded-office.com
*                    Copyright 1992-2020 Silicon Laboratories Inc. www.silabs.com
*
*                                 SPDX-License-Identifier: APACHE-2.0
*
*               This software is subject to an open source license and is distributed by
*                Silicon Laboratories Inc. pursuant to the terms of the Apache License,
*                    Version 2.0 available at www.apache.org/licenses/LICENSE-2.0.
*
*********************************************************************************************************
*/


/*
*********************************************************************************************************
*                                      CAN DRIVER REGISTER CODE
*
*                                            Renesas RX200
*
* Filename : drv_can_reg.h
* Version  : V2.42.01
*********************************************************************************************************
* Note(s)  : (1) This CAN Driver supports the following Series/Families:
*                    RX200 Driver - Renesas RX200    Family.
*                                 - Renesas RL78-F13 Series.
*                                 - Renesas RL78-F14 Series.
*
*                Set by the Technical Reference Manual(s) obtained from the Renesas website. This driver
*                has been tested with or should work with the families mentioned above.
*********************************************************************************************************
*/

#ifndef _DRV_CAN_REG_H
#define _DRV_CAN_REG_H


/*
*********************************************************************************************************
*                                              INCLUDES
*********************************************************************************************************
*/

#include "cpu.h"
#include "can_cfg.h"


/*
*********************************************************************************************************
*                                          ADDRESS REGISTERS
*********************************************************************************************************
*/
                                                                /* ------------------- BASE ADDRESS ------------------- */
#define  RX200_CAN_ADDR                         0x000A8300u
#define  RL78F_CAN_ADDR                         0x000F0300u

                                                                /* --------- RECEIVE RULE ENTRY ADDRESS OFFSET -------- */
#define  RX200_CAN_RR_ADDR_OFFSET               0xA0u


/*
*********************************************************************************************************
*                                           BIT DEFINITIONS
*********************************************************************************************************
*/
                                                                /* ---------------- CONTROL REGISTER L ---------------- */
#define  RX200_CAN_CTRL_CHMDC_COMM             (0u << 0u)
#define  RX200_CAN_CTRL_CHMDC_RESET            (1u << 0u)
#define  RX200_CAN_CTRL_CHMDC_HALT             (2u << 0u)
#define  RX200_CAN_CTRL_CHMDC_MASK              0x03u

#define  RX200_CAN_CTRL_CSLPR                   DEF_BIT_02
#define  RX200_CAN_CTRL_RTBO                    DEF_BIT_03
#define  RX200_CAN_CTRL_BEIE                    DEF_BIT_08
#define  RX200_CAN_CTRL_EWIE                    DEF_BIT_09
#define  RX200_CAN_CTRL_EPIE                    DEF_BIT_10
#define  RX200_CAN_CTRL_BOEIE                   DEF_BIT_11
#define  RX200_CAN_CTRL_BORIE                   DEF_BIT_12
#define  RX200_CAN_CTRL_OLIE                    DEF_BIT_13
#define  RX200_CAN_CTRL_BLIE                    DEF_BIT_14
#define  RX200_CAN_CTRL_ALIE                    DEF_BIT_15

                                                                /* ---------------- CONTROL REGISTER H ---------------- */
#define  RX200_CAN_CTRH_TAIE                    DEF_BIT_00

#define  RX200_CAN_CTRH_BOM_ISO11898           (0u << 5u)
#define  RX200_CAN_CTRH_BOM_HALT_ENTRY         (1u << 5u)
#define  RX200_CAN_CTRH_BOM_HALT_END           (2u << 5u)
#define  RX200_CAN_CTRH_BOM_HALT_PROGRAM       (3u << 5u)

#define  RX200_CAN_CTRH_ERRD                    DEF_BIT_07
#define  RX200_CAN_CTRH_CTME                    DEF_BIT_08

#define  RX200_CAN_CTRH_CTMS_STANDARD          (0u << 9u)
#define  RX200_CAN_CTRH_CTMS_LISTEN_ONLY       (1u << 9u)
#define  RX200_CAN_CTRH_CTMS_EXT_LOOP          (2u << 9u)
#define  RX200_CAN_CTRH_CTMS_INT_LOOP          (3u << 9u)

                                                                /* ----------------- STATUS REGISTER L ---------------- */
#define  RX200_CAN_STSL_CRSTSTS                 DEF_BIT_00
#define  RX200_CAN_STSL_CHLTSTS                 DEF_BIT_01
#define  RX200_CAN_STSL_CSLPSTS                 DEF_BIT_02
#define  RX200_CAN_STSL_EPSTS                   DEF_BIT_03
#define  RX200_CAN_STSL_BOSTS                   DEF_BIT_04
#define  RX200_CAN_STSL_TRMSTS                  DEF_BIT_05
#define  RX200_CAN_STSL_RECSTS                  DEF_BIT_06
#define  RX200_CAN_STSL_COMSTS                  DEF_BIT_07

                                                                /* --------------- ERROR FLAG REGISTER L -------------- */
#define  RX200_CAN_ERFLL_BEF                    DEF_BIT_00
#define  RX200_CAN_ERFLL_EWF                    DEF_BIT_01
#define  RX200_CAN_ERFLL_EPF                    DEF_BIT_02
#define  RX200_CAN_ERFLL_BOEF                   DEF_BIT_03
#define  RX200_CAN_ERFLL_BORF                   DEF_BIT_04
#define  RX200_CAN_ERFLL_OVLF                   DEF_BIT_05
#define  RX200_CAN_ERFLL_BLF                    DEF_BIT_06
#define  RX200_CAN_ERFLL_ALF                    DEF_BIT_07
#define  RX200_CAN_ERFLL_SERR                   DEF_BIT_08
#define  RX200_CAN_ERFLL_FERR                   DEF_BIT_09
#define  RX200_CAN_ERFLL_AERR                   DEF_BIT_10
#define  RX200_CAN_ERFLL_CERR                   DEF_BIT_11
#define  RX200_CAN_ERFLL_B1ERR                  DEF_BIT_12
#define  RX200_CAN_ERFLL_B0ERR                  DEF_BIT_13
#define  RX200_CAN_ERFLL_ADERR                  DEF_BIT_14

                                                                /* ---------- GLOBAL CONFIGURATION REGISTER L --------- */
#define  RX200_CAN_GCFGL_TPRI                   DEF_BIT_00
#define  RX200_CAN_GCFGL_DCE                    DEF_BIT_01
#define  RX200_CAN_GCFGL_DRE                    DEF_BIT_02
#define  RX200_CAN_GCFGL_MME                    DEF_BIT_03
#define  RX200_CAN_GCFGL_DCS                    DEF_BIT_04

#define  RX200_CAN_GCFGL_TSP_DIV_NONE          (0u  << 8u)
#define  RX200_CAN_GCFGL_TSP_DIV_2             (1u  << 8u)
#define  RX200_CAN_GCFGL_TSP_DIV_4             (2u  << 8u)
#define  RX200_CAN_GCFGL_TSP_DIV_8             (3u  << 8u)
#define  RX200_CAN_GCFGL_TSP_DIV_16            (4u  << 8u)
#define  RX200_CAN_GCFGL_TSP_DIV_32            (5u  << 8u)
#define  RX200_CAN_GCFGL_TSP_DIV_64            (6u  << 8u)
#define  RX200_CAN_GCFGL_TSP_DIV_128           (7u  << 8u)
#define  RX200_CAN_GCFGL_TSP_DIV_256           (8u  << 8u)
#define  RX200_CAN_GCFGL_TSP_DIV_512           (9u  << 8u)
#define  RX200_CAN_GCFGL_TSP_DIV_1024          (10u << 8u)
#define  RX200_CAN_GCFGL_TSP_DIV_2048          (11u << 8u)
#define  RX200_CAN_GCFGL_TSP_DIV_4096          (12u << 8u)
#define  RX200_CAN_GCFGL_TSP_DIV_8192          (13u << 8u)
#define  RX200_CAN_GCFGL_TSP_DIV_16384         (14u << 8u)
#define  RX200_CAN_GCFGL_TSP_DIV_32768         (15u << 8u)

