embedded-office/uc-can/Drivers/RX200/drv_can_reg.h
#define  RX200_CAN_GCFGL_TSSS                   DEF_BIT_12

                                                                /* ------------- GLOBAL CONTROL REGISTER L ------------ */
#define  RX200_CAN_GCTRL_GMDC_OPERATING        (0u << 0u)
#define  RX200_CAN_GCTRL_GMDC_RESET            (1u << 0u)
#define  RX200_CAN_GCTRL_GMDC_TEST             (2u << 0u)
#define  RX200_CAN_GCTRL_GMDC_MASK              0x03u

#define  RX200_CAN_GCTRL_GSLPR                  DEF_BIT_02
#define  RX200_CAN_GCTRL_DEIE                   DEF_BIT_08
#define  RX200_CAN_GCTRL_MEIE                   DEF_BIT_09
#define  RX200_CAN_GCTRL_THLEIE                 DEF_BIT_10

                                                                /* ------------- GLOBAL CONTROL REGISTER H ------------ */
#define  RX200_CAN_GCTRH_TSRST                  DEF_BIT_00

                                                                /* -------------- GLOBAL STATUS REGISTER -------------- */
#define  RX200_CAN_GSTS_GRSTSTS                 DEF_BIT_00
#define  RX200_CAN_GSTS_GHLTSTS                 DEF_BIT_01
#define  RX200_CAN_GSTS_GSLPSTS                 DEF_BIT_02
#define  RX200_CAN_GSTS_GRAMINIT                DEF_BIT_03

                                                                /* ------------ GLOBAL ERROR FLAG REGISTER ------------ */
#define  RX200_CAN_GERFLL_DEF                   DEF_BIT_00
#define  RX200_CAN_GERFLL_MES                   DEF_BIT_01
#define  RX200_CAN_GERFLL_THLES                 DEF_BIT_02

                                                                /* ----------- GLOBAL TX INT STATUS REGISTER ---------- */
#define  RX200_CAN_GTINTSTS_TSIF0               DEF_BIT_00
#define  RX200_CAN_GTINTSTS_TAIF0               DEF_BIT_01
#define  RX200_CAN_GTINTSTS_CFTIF0              DEF_BIT_02
#define  RX200_CAN_GTINTSTS_THIF0               DEF_BIT_03

                                                                /* ------------- Rx BUFFER / FIFO REG xAH ------------- */
#define  RX200_CAN_RxIDHn_RMRTR                 DEF_BIT_14
#define  RX200_CAN_RxIDHn_RMIDE                 DEF_BIT_15

                                                                /* ---------- Rx FIFO & Tx/Rx FIFO CTRL REG x --------- */
#define  RX200_CAN_xFCCn_xFE                    DEF_BIT_00
#define  RX200_CAN_xFCCn_xFIE                   DEF_BIT_01
#define  RX200_CAN_xFCCn_CFTXIE                 DEF_BIT_02      /* Applies only to Tx/Rx FIFO Control Register 0L.      */

#define  RX200_CAN_xFCCn_xFDC_0_MSGs           (0u << 8u)
#define  RX200_CAN_xFCCn_xFDC_4_MSGs           (1u << 8u)
#define  RX200_CAN_xFCCn_xFDC_8_MSGs           (2u << 8u)
#define  RX200_CAN_xFCCn_xFDC_16_MSGs          (3u << 8u)

#define  RX200_CAN_xFCCn_xFIM                   DEF_BIT_12

#define  RX200_CAN_xFCCn_xFIGCV_1_8_FULL       (0u << 13u)
#define  RX200_CAN_xFCCn_xFIGCV_2_8_FULL       (1u << 13u)
#define  RX200_CAN_xFCCn_xFIGCV_3_8_FULL       (2u << 13u)
#define  RX200_CAN_xFCCn_xFIGCV_4_8_FULL       (3u << 13u)
#define  RX200_CAN_xFCCn_xFIGCV_5_8_FULL       (4u << 13u)
#define  RX200_CAN_xFCCn_xFIGCV_6_8_FULL       (5u << 13u)
#define  RX200_CAN_xFCCn_xFIGCV_7_8_FULL       (6u << 13u)
#define  RX200_CAN_xFCCn_xFIGCV_FULL           (7u << 13u)

                                                                /* ------------- Tx/Rx FIFO CONTROL REG 0H ------------ */
#define  RX200_CAN_CFCCH0_CFM_Rx               (0u << 0u)
#define  RX200_CAN_CFCCH0_CFM_Tx               (1u << 0u)

#define  RX200_CAN_CFCCH0_CFITSS                DEF_BIT_02
#define  RX200_CAN_CFCCH0_CFITR                 DEF_BIT_03

                                                                /* --------- Rx FIFO & Tx/Rx FIFO STATUS REG x -------- */
#define  RX200_CAN_xFSTSn_xFEMP                 DEF_BIT_00
#define  RX200_CAN_xFSTSn_xFFLL                 DEF_BIT_01
#define  RX200_CAN_xFSTSn_xFMLT                 DEF_BIT_02
#define  RX200_CAN_xFSTSn_xFIF                  DEF_BIT_03
#define  RX200_CAN_xFSTSn_CFTXIF                DEF_BIT_04      /* Applies only to Tx/Rx FIFO Status Register 0.        */

                                                                /* ------ Rx FIFO & Tx/Rx FIFO POINTER CTRL REG x ----- */
#define  RX200_CAN_xFPCTRn_xFPC_0xFFu           0xFFu

                                                                /* ------------ Rx FIFO MSG LOST STATUS REG ----------- */
#define  RX200_CAN_RFMSTS_RF0MLT                DEF_BIT_00
#define  RX200_CAN_RFMSTS_RF1MLT                DEF_BIT_01

                                                                /* ---------- Tx/Rx FIFO MSG LOST STATUS REG ---------- */
#define  RX200_CAN_CFMSTS_CF0MLT                DEF_BIT_00

                                                                /* --------------- Rx FIFO INT STATUS REG ------------- */
#define  RX200_CAN_RFISTS_RF0IF                 DEF_BIT_00
#define  RX200_CAN_RFISTS_RF1IF                 DEF_BIT_01

                                                                /* ------------- Tx/Rx FIFO INT STATUS REG ------------ */
#define  RX200_CAN_CFISTS_CF0IF                 DEF_BIT_00

                                                                /* --------- TRANSMIT BUFFER CONTROL REGISTER --------- */
#define  RX200_CAN_TMCx_TMTR                    DEF_BIT_00
#define  RX200_CAN_TMCx_TMTAR                   DEF_BIT_01
#define  RX200_CAN_TMCx_TMOM                    DEF_BIT_02

                                                                /* ---------- TRANSMIT BUFFER STATUS REGISTER --------- */
#define  RX200_CAN_TMSTSx_TMTSTS                DEF_BIT_00

#define  RX200_CAN_TMSTSx_TMTRF_Tx_PROG        (0u << 1u)
#define  RX200_CAN_TMSTSx_TMTRF_Tx_COMP        (1u << 1u)
#define  RX200_CAN_TMSTSx_TMTRF_Tx_NO_ABRT     (2u << 1u)
#define  RX200_CAN_TMSTSx_TMTRF_Tx_ABRT        (3u << 1u)

#define  RX200_CAN_TMSTSx_TMTRM                 DEF_BIT_03
#define  RX200_CAN_TMSTSx_TMTARM                DEF_BIT_04

                                                                /* ----- Tx BUFF Tx REQUEST/COMP/ABORT STATUS REG ----- */
#define  RX200_CAN_TMTxSTS_TMTxSTS0             DEF_BIT_00
#define  RX200_CAN_TMTxSTS_TMTxSTS1             DEF_BIT_01
#define  RX200_CAN_TMTxSTS_TMTxSTS2             DEF_BIT_02
#define  RX200_CAN_TMTxSTS_TMTxSTS3             DEF_BIT_03

                                                                /* ---------- TRANSMIT BUFFER INT ENABLE REG ---------- */
#define  RX200_CAN_TMIEC_TMIE0                  DEF_BIT_00
#define  RX200_CAN_TMIEC_TMIE1                  DEF_BIT_01
#define  RX200_CAN_TMIEC_TMIE2                  DEF_BIT_02
#define  RX200_CAN_TMIEC_TMIE3                  DEF_BIT_03

                                                                /* -------- Tx/Rx FIFO & Tx BUFFER REGISTER xAH ------- */
#define  RX200_CAN_TxIDHn_THELN                 DEF_BIT_13
#define  RX200_CAN_TxIDHn_TMRTR                 DEF_BIT_14
#define  RX200_CAN_TxIDHn_TMIDE                 DEF_BIT_15

                                                                /* ----------- Tx HISTORY BUFFER CONTROL REG ---------- */
#define  RX200_CAN_THLCC0_THLE                  DEF_BIT_00
#define  RX200_CAN_THLCC0_THLIE                 DEF_BIT_08
#define  RX200_CAN_THLCC0_THLIM                 DEF_BIT_09
#define  RX200_CAN_THLCC0_THLDTE                DEF_BIT_10

                                                                /* ----------- Tx HISTORY BUFFER STATUS REG ----------- */
#define  RX200_CAN_THLSTS0_THLEMP               DEF_BIT_00
#define  RX200_CAN_THLSTS0_THLFLL               DEF_BIT_01
#define  RX200_CAN_THLSTS0_THLELT               DEF_BIT_02
#define  RX200_CAN_THLSTS0_THLIF                DEF_BIT_03

