embedded-office/uc-can/Drivers/RX200/drv_can_reg.h
                                                                /* ----------- Tx HISTORY BUFFER ACCESS REG ----------- */
#define  RX200_CAN_THLACC0_BT_Tx                DEF_BIT_00
#define  RX200_CAN_THLACC0_BT_Tx_FIFO           DEF_BIT_01

                                                                /* --------- Tx HISTORY BUFF POINTER CTRL REG --------- */
#define  RX200_CAN_THLPCTR0_THLPC_0xFFu         0xFFu

                                                                /* ----------- GLOBAL RAM WINDOW CONTROL REG ---------- */
#define  RX200_CAN_GRWCR_RPAGE                  DEF_BIT_00

                                                                /* ----------- GLOBAL TEST CONTROL REGISTER ----------- */
#define  RX200_CAN_GTSTCTRL_RTME                DEF_BIT_02

                                                                /* --------- GLOBAL TEST PROTECTION UNLOCK REG -------- */
#define  RX200_CAN_GLOCKK_KEY1                  0x7575u
#define  RX200_CAN_GLOCKK_KEY2                  0x8A8Au

                                                                /* ------------ RECEIVE RULE ENTRY REG xAH ------------ */
#define  RX200_CAN_GAFLIDHx_GAFLLB              DEF_BIT_13
#define  RX200_CAN_GAFLIDHx_GAFLRTR             DEF_BIT_14
#define  RX200_CAN_GAFLIDHx_GAFLIDE             DEF_BIT_15

                                                                /* ------------ RECEIVE RULE ENTRY REG xBH ------------ */
#define  RX200_CAN_GAFLMHx_GAFLRTRM             DEF_BIT_14
#define  RX200_CAN_GAFLMHx_GAFLIDEM             DEF_BIT_15

                                                                /* ------------ RECEIVE RULE ENTRY REG xCL ------------ */
#define  RX200_CAN_GAFLPLx_GAFLFDP0             DEF_BIT_00
#define  RX200_CAN_GAFLPLx_GAFLFDP1             DEF_BIT_01
#define  RX200_CAN_GAFLPLx_GAFLFDP4             DEF_BIT_04
#define  RX200_CAN_GAFLPLx_GAFLRMV              DEF_BIT_15


/*
*********************************************************************************************************
*                                               MACROS
*********************************************************************************************************
*/
                                                                /*               WINDOW SELECT : WINDOW 0               */
                                                                /* ---------------------------------------------------- */
                                                                /* -------------- RECEIVE RULE CONFIG REG ------------- */
#define  RX200_CAN_GAFLCFG_RNC0(x)            ((x) & 0x1Fu)     /* Set the Number of Receive Rules of CAN Channel.      */

                                                                /* ---------- RECEIVE RULE ENTRY x ID & MASK ---------- */
#define  RX200_CAN_GAFLIxLn_GAFLIDx_STD(x)    ((x) & 0x07FFu)   /* Standard ID ONLY.  ID (xAL) & Mask (xBL) Register.   */
#define  RX200_CAN_GAFLIxLn_GAFLIDx_EXT(x)    ((x) & 0xFFFFu)   /* Extended ID START. ID (xAL) & Mask (xBL) Register.   */
                                                                /* Extended ID CONT.  ID (xAL) & Mask (xBL) Register.   */
#define  RX200_CAN_GAFLIxHn_GAFLIDx(x)       (((x) >> 16u) & 0x1FFFu)

                                                                /* ------------ RECEIVE RULE ENTRY REG xCL ------------ */
                                                                /* Set the Rx Buffer # to Store the Rx'd Messages.      */
#define  RX200_CAN_GAFLPLx_GAFLRMDP(x)       (((x) & 0x7Fu) << 8u)

                                                                /* ------------- RECEIVE RULE ENTRY x DLC ------------- */
#define  RX200_CAN_GAFLPHx_GAFLPTR(x)         ((x) & 0x0FFFu)   /* Receive Rule Set Label Data.                         */
                                                                /* Receive Rule DLC Size Check.                         */
#define  RX200_CAN_GAFLPHx_GAFLDLC(x)        (((x) & 0x0Fu) << 12u)

                                                                /*               WINDOW SELECT : WINDOW 1               */
                                                                /* ---------------------------------------------------- */
                                                                /* ----------- BIT CONFIGURATION REGISTER L ----------- */
#define  RX200_CAN_CFGL_BRP(x)                ((x) & 0x03FFu)   /* Set Prescaler Division Ratio.                        */

                                                                /* ----------- BIT CONFIGURATION REGISTER H ----------- */
                                                                /* Set Time Segment 1 Control. Based on Reg. Defines.   */
#define  RX200_CAN_CFGH_TSEG1(x)             (((x) - 1u) & 0x0Fu)
                                                                /* Set Time Segment 2 Control. Based on Reg. Defines.   */
#define  RX200_CAN_CFGH_TSEG2(x)            ((((x) - 1u) & 0x07u) << 4u)
                                                                /* Set Resynchronization Jump Width Control. Reg Defs.  */
#define  RX200_CAN_CFGH_SJW(x)              ((((x) - 1u) & 0x03u) << 8u)

                                                                /* ----------------- STATUS REGISTER H ---------------- */
#define  RX200_CAN_STSH_REC(x)                ((x) & 0xFFu)     /* Read Receive  Error Counter.                         */
                                                                /* Read Transmit Error Counter.                         */
#define  RX200_CAN_STSH_TEC(x)               (((x) >> 8u) & 0xFFu)

                                                                /* --------------- ERROR FLAG REGISTER H -------------- */
                                                                /* Read RCR Value based on Tx'd Message.                */
#define  RX200_CAN_ERFLH_CRCREG               ((x) & 0x7FFFFFFFu)

                                                                /* --------- Rx BUFFER NUMBER CONFIG REGISTER --------- */
#define  RX200_CAN_RMNB_NRXMB(x)              ((x) & 0x1Fu)     /* Set the Number of Rx Buffers. Value [0 -> 16].       */

