embedded-office/uc-can/Drivers/RX200/drv_can_reg.h
                                                                /* ------------- Rx BUFFER / FIFO REG x ID ------------ */
#define  RX200_CAN_RxIDLn_RMID_STD(x)         ((x) & 0x07FFu)   /* Standard ID ONLY.  Rx Buffer / FIFO ID Data L Reg.   */
#define  RX200_CAN_RxIDLn_RMID_EXT(x)         ((x) & 0xFFFFu)   /* Extended ID START. Rx Buffer / FIFO ID Data L Reg.   */
#define  RX200_CAN_RxIDHn_RMID(x)             ((x) & 0x1FFFu)   /* Extended ID CONT.  Rx Buffer / FIFO ID Data L Reg.   */

                                                                /* ------------ Rx BUFFER / FIFO REG x DLC ------------ */
#define  RX200_CAN_RxPTRn_RMPTR(x)            ((x) & 0x0FFFu)   /* Receive Buffer Label Data. Label Info of Rx'd Msg.   */
                                                                /* Get Rx'd Buffer DLC Size.                            */
#define  RX200_CAN_RxPTRn_RMDLC(x)           (((x) >> 12u) & 0x0Fu)

                                                                /* ------------ Rx BUFFER / FIFO REG x DATA ----------- */
#define  RX200_CAN_RxDFnX_DATA_L(x)           ((x) & 0xFFu)     /* Rx Data From RMDFnX & RFDFnX Regs. Lower -Byte Data. */
                                                                /* Rx Data From RMDFnX & RFDFnX Regs. Higher-Byte Data. */
#define  RX200_CAN_RxDFnX_DATA_H(x)          (((x) >> 8u) & 0xFFu)

                                                                /* ------------- Rx FIFO STATUS REGISTER x ------------ */
                                                                /* Rx FIFO Number of Unread Messages.                   */
#define  RX200_CAN_RFSTSx_RFMC(x)            (((x) >> 8u) & 0x3Fu)

                                                                /* ------------- Tx/Rx FIFO CONTROL REG 0H ------------ */
                                                                /* Set Tx Buffer Number Linked to Tx/Rx FIFO Buffer.    */
#define  RX200_CAN_CFCCH0_CFTML(x)           (((x) & 0x03u) << 4u)
                                                                /* Set Message Transmission Interval.                   */
#define  RX200_CAN_CFCCH0_CFITT(x)           (((x) & 0xFFu) << 8u)

                                                                /* ------------- Tx/Rx FIFO STATUS REG 0H ------------- */
#define  RX200_CAN_CFSTS0_CFMC(x)            (((x) >> 8u) & 0x3Fu)

                                                                /* ------------ Tx/Rx FIFO & TX BUFFER x ID ----------- */
#define  RX200_CAN_TxIDLn_CFID_STD(x)         ((x) & 0x07FFu)   /* Standard ID ONLY.  Tx/Rx FIFO & Tx BUFFER xL Reg.    */
#define  RX200_CAN_TxIDLn_CFID_EXT(x)         ((x) & 0xFFFFu)   /* Extended ID START. Tx/Rx FIFO & Tx BUFFER xL Reg.    */
                                                                /* Extended ID CONT.  Tx/Rx FIFO & Tx BUFFER xL Reg.    */
#define  RX200_CAN_TxIDHn_CFID(x)            (((x) >> 16u) & 0x1FFFu)

                                                                /* ----------- Tx/Rx FIFO & TX BUFFER x DLC ----------- */
#define  RX200_CAN_TxPTRn_TxPTR(x)            ((x) & 0x0FFFu)   /* Transmit Buffer Label Data. Label Info of Tx'd Msg.  */
                                                                /* Set Tx'd Buffer DLC Size.                            */
#define  RX200_CAN_TxPTRn_TxDLC(x)           (((x) & 0x0Fu) << 12u)

                                                                /* ----------- Tx/Rx FIFO & TX BUFFER x DATA ---------- */
#define  RX200_CAN_TxDF0n_DATA_L(x)           ((x) & 0xFFu)     /* Tx Data To CFDF0,1,2,3 Register. Lower -Byte Data.   */
                                                                /* Tx Data To CFDF0,1,2,3 Register. Higher-Byte Data.   */
#define  RX200_CAN_TxDF0n_DATA_H(x)          (((x) & 0xFFu) << 8u)

                                                                /* ----------- Tx HISTORY BUFFER STATUS REG ----------- */
                                                                /* Tx History Buffer Unread Data Sets.                  */
#define  RX200_CAN_THLSTS0_THLMC(x)          (((x) >> 8u) & 0x0Fu)

                                                                /* ----------- Tx HISTORY BUFFER ACCESS REG ----------- */
                                                                /* Buffer Number of Tx Source.                          */
#define  RX200_CAN_THLACC0_BN(x)             (((x) >> 3u) & 0x03u)
                                                                /* Label Information of Tx Stored Data.                 */
#define  RX200_CAN_THLACC0_TID(x)            (((x) >> 8u) & 0xFFu)


/*
*********************************************************************************************************
*                                             DATA ARRAY
*********************************************************************************************************
*/


/*
*********************************************************************************************************
*                                             DATA TYPES
*********************************************************************************************************
*/


/*
*********************************************************************************************************
*                                            CAN REGISTER
*
* Description : Structure defines the CAN Register Structure.
*
* Note(s)     : none.
*********************************************************************************************************
*/
                                                                /* -------------- RX200 CAN REGISTER MAP -------------- */
typedef  volatile  struct  rx200_can_reg {                      /* ------------ CONTROL & STATUS REGISTERs ------------ */
    CPU_REG16  CFGL;                                            /* Bit Configuration    Register L.                     */
    CPU_REG16  CFGH;                                            /* Bit Configuration    Register  H.                    */
    CPU_REG16  CTRL;                                            /* Control              Register L.                     */
    CPU_REG16  CTRH;                                            /* Control              Register  H.                    */
    CPU_REG16  STSL;                                            /* Status               Register L.                     */
    CPU_REG16  STSH;                                            /* Status               Register  H.                    */
    CPU_REG16  ERFLL;                                           /* Error Flag           Register L.                     */
    CPU_REG16  ERFLH;                                           /* Error Flag           Register  H.                    */
    CPU_REG16  RSVD_00[9u];                                     /* Reserved.    [0x000A 8310 -> 0x000A 8320]            */
    CPU_REG16  GCFGL;                                           /* Global Configuration Register L.                     */
    CPU_REG16  GCFGH;                                           /* Global Configuration Register  H.                    */
    CPU_REG16  GCTRL;                                           /* Global Control       Register L.                     */
    CPU_REG16  GCTRH;                                           /* Global Control       Register  H.                    */
    CPU_REG16  GSTS;                                            /* Global Status        Register.                       */
    CPU_REG08  GERFLL;                                          /* Global Error Flag    Register.                       */
    CPU_REG08  RSVD_01;                                         /* Reserved.    [0x000A 832D]                           */
    CPU_REG16  GTSC;                                            /* Timestamp            Register.                       */
    CPU_REG16  GAFLCFG;                                         /* Receive Rule   Number Configuration  Register.       */
    CPU_REG16  RMNB;                                            /* Receive Buffer Number Configuration  Register.       */
    CPU_REG16  RMND0;                                           /* Receive Buffer Receive Complete Flag Register.       */
    CPU_REG16  RSVD_02;                                         /* Reserved.    [0x000A 8336]                           */
    CPU_REG16  RFCC0;                                           /* Receive FIFO Control Register 0.                     */
    CPU_REG16  RFCC1;                                           /* Receive FIFO Control Register 1.                     */
    CPU_REG16  RSVD_03[2u];                                     /* Reserved.                                            */
    CPU_REG16  RFSTS0;                                          /* Receive FIFO Status  Register 0.                     */
    CPU_REG16  RFSTS1;                                          /* Receive FIFO Status  Register 1.                     */
    CPU_REG16  RSVD_04[2u];                                     /* Reserved.    [0x000A 8344 -> 0x000A 8346]            */
    CPU_REG16  RFPCTR0;                                         /* Receive FIFO Pointer Control Register 0.             */
    CPU_REG16  RFPCTR1;                                         /* Receive FIFO Pointer Control Register 1.             */
    CPU_REG16  RSVD_05[2u];                                     /* Reserved.    [0x000A 834C -> 0x000A 834E]            */
    CPU_REG16  CFCCL0;                                          /* Transmit / Receive FIFO Control Reigster 0 L.        */
    CPU_REG16  CFCCH0;                                          /* Transmit / Receive FIFO Control Reigster 0  H.       */
    CPU_REG16  RSVD_06[2u];                                     /* Reserved.    [0x000A 8354 -> 0x000A 8356]            */
    CPU_REG16  CFSTS0;                                          /* Transmit / Receive FIFO Status  Register 0.          */
    CPU_REG16  RSVD_07;                                         /* Reserved.    [0x000A 835A]                           */
    CPU_REG16  CFPCTR0;                                         /* Transmit / Receive FIFO Pointer Control Register 0.  */
    CPU_REG16  RSVD_08;                                         /* Reserved.    [0x000A 835E]                           */
    CPU_REG08  RFMSTS;                                          /* Receive FIFO Message Lost Status Register.           */
    CPU_REG08  CFMSTS;                                          /* Transmit / Receive FIFO Message Lost Register.       */
    CPU_REG08  RFISTS;                                          /* Receive FIFO Interrupt Status Register.              */
    CPU_REG08  CFISTS;                                          /* Transmit / Receive FIFO Rx Interrupt Status Register.*/
    CPU_REG08  TMCx[4u];                                        /* Transmit Buffer Control Register(s) : 0, 1, 2, 3.    */
    CPU_REG08  RSVD_09[4u];                                     /* Reserved.    [0x000A 8368 -> 0x000A 836B]            */
    CPU_REG08  TMSTSx[4u];                                      /* Transmit Buffer Status  Register(s) : 0, 1, 2, 3.    */
    CPU_REG08  RSVD_10[4u];                                     /* Reserved.    [0x000A 8370 -> 0x000A 8373]            */
    CPU_REG16  TMTRSTS;                                         /* Transmit Buffer Transmit Request  Status Register.   */
    CPU_REG16  TMTCSTS;                                         /* Transmit Buffer Transmit Complete Status Register.   */
    CPU_REG16  TMTASTS;                                         /* Transmit Buffer Transmit Abort    Status Register.   */
    CPU_REG16  TMIEC;                                           /* Transmit Buffer Interrupt Enable         Register.   */
    CPU_REG16  THLCC0;                                          /* Transmit History Buffer Control          Register.   */
    CPU_REG16  RSVD_11;                                         /* Reserved.    [0x000A 837C]                           */
    CPU_REG16  THLSTS0;                                         /* Transmit History Buffer Status           Register.   */
    CPU_REG16  RSVD_12;                                         /* Reserved.    [0x000A 8382]                           */
    CPU_REG16  THLPCTR0;                                        /* Transmit History Buffer Pointer Control  Register.   */
    CPU_REG16  RSVD_13;                                         /* Reserved.    [0x000A 8386]                           */
    CPU_REG16  GTINTSTS;                                        /* Global Transmit Interrupt Status Register.           */
    CPU_REG16  GRWCR;                                           /* Global RAM Window Control        Register.           */
    CPU_REG16  GTSTCFG;                                         /* Global Test Configuration        Register.           */
    CPU_REG16  GTSTCTRL;                                        /* Global Test Control              Register.           */
    CPU_REG16  RSVD_14[2u];                                     /* Reserved.    [0x000A 8390 -> 0x000A 8392]            */
    CPU_REG16  GLOCKK;                                          /* Global Test Protection Unlock    Register.           */
    CPU_REG16  RSVD_15[5u];                                     /* Reserved.    [0x000A 8396 -> 0x000A 839E]            */
    struct {                                                    /* ------------- RECEIVE BUFFER REGISTERs ------------- */
        CPU_REG16  RMIDLx;                                      /* Receive Buffer Register xAL. [ID Register]           */
        CPU_REG16  RMIDHx;                                      /* Receive Buffer Register xAH. [ID Register]           */
        CPU_REG16  RMTSx;                                       /* Receive Buffer Register xBL. [Timestamp Register]    */
        CPU_REG16  RMPTRx;                                      /* Receive Buffer Register xBH. [DLC Register]          */
        CPU_REG16  RMDF0x;                                      /* Receive Buffer Register xCL. [Data 0 & 1 Register]   */
        CPU_REG16  RMDF1x;                                      /* Receive Buffer Register xCH. [Data 2 & 3 Register]   */
        CPU_REG16  RMDF2x;                                      /* Receive Buffer Register xDL. [Data 4 & 5 Register]   */
        CPU_REG16  RMDF3x;                                      /* Receive Buffer Register xDH. [Data 6 & 7 Register]   */
    } RX[16u];
    CPU_REG16  RSVD_16[128u];                                   /* Reserved.    [0x000A 84A0 -> 0x000A 859E]            */
    struct {                                                    /* ----------- RECEIVE FIFO ACCESS REGISTERs ---------- */
        CPU_REG16  RFIDLx;                                      /* Receive FIFO Access Register xAL. [ID Register]      */
        CPU_REG16  RFIDHx;                                      /* Receive FIFO Access Register xAH. [ID Register]      */
        CPU_REG16  RFTSx;                                       /* Receive FIFO Access Register xBL. [Timestamp Reg]    */
        CPU_REG16  RFPTRx;                                      /* Receive FIFO Access Register xBH. [DLC Register]     */
        CPU_REG16  RFDF0x;                                      /* Receive FIFO Access Register xCL. [Data 0 & 1 Reg]   */
        CPU_REG16  RFDF1x;                                      /* Receive FIFO Access Register xCH. [Data 2 & 3 Reg]   */
        CPU_REG16  RFDF2x;                                      /* Receive FIFO Access Register xDL. [Data 4 & 5 Reg]   */
        CPU_REG16  RFDF3x;                                      /* Receive FIFO Access Register xDH. [Data 6 & 7 Reg]   */
    } RX_FIFO[2u];
    CPU_REG16  RSVD_17[16u];                                    /* Reserved.    [0x000A 85C0 -> 0x000A 85DE]            */
                                                                /* ----------- Tx / Rx FIFO ACCESS REGISTERs ---------- */
    CPU_REG16  CFIDL0;                                          /* Tx / Rx FIFO Access Register 0AL. [ID Register]      */
    CPU_REG16  CFIDH0;                                          /* Tx / Rx FIFO Access Register 0AH. [ID Register]      */
    CPU_REG16  CFTS0;                                           /* Tx / Rx FIFO Access Register 0BL. [Timestamp Reg]    */
    CPU_REG16  CFPTR0;                                          /* Tx / Rx FIFO Access Register 0BH. [DLC Register]     */
    CPU_REG16  CFDF00;                                          /* Tx / Rx FIFO Access Register 0CL. [Data 0 & 1 Reg]   */
    CPU_REG16  CFDF10;                                          /* Tx / Rx FIFO Access Register 0CH. [Data 2 & 3 Reg]   */
    CPU_REG16  CFDF20;                                          /* Tx / Rx FIFO Access Register 0DL. [Data 4 & 5 Reg]   */
    CPU_REG16  CFDF30;                                          /* Tx / Rx FIFO Access Register 0DH. [Data 6 & 7 Reg]   */
    CPU_REG16  RSVD_18[8u];                                     /* Reserved.    [0x000A 85F0 -> 0x000A 85FE]            */
    struct {                                                    /* ------------- TRANSMIT BUFFER REGISTERs ------------ */
        CPU_REG16  TMIDLx;                                      /* Transmit Buffer Register xAL. [ID Register]          */
        CPU_REG16  TMIDHx;                                      /* Transmit Buffer Register xAH. [ID Register]          */
        CPU_REG16  RSVD_19;                                     /* Reserved     [0x000A 00x4]    [No Timestamp]         */
        CPU_REG16  TMPTRx;                                      /* Transmit Buffer Register xBH. [DLC Register]         */
        CPU_REG16  TMDF0x;                                      /* Transmit Buffer Register xCL. [Data 0 & 1 Register]  */
        CPU_REG16  TMDF1x;                                      /* Transmit Buffer Register xCH. [Data 2 & 3 Register]  */
        CPU_REG16  TMDF2x;                                      /* Transmit Buffer Register xDL. [Data 4 & 5 Register]  */
        CPU_REG16  TMDF3x;                                      /* Transmit Buffer Register xDH. [Data 6 & 7 Register]  */
    } TX[4u];
    CPU_REG16  RSVD_20[32u];                                    /* Reserved.    [0x000A 8640 -> 0x000A xxxx]            */
    CPU_REG16  THLACC0;                                         /* Transmit History Buffer Access Register.             */
} RX200_CAN_REG;


typedef  volatile  struct  rx200_can_rr_reg {                   /* -------- RX200 CAN RECEIVE RULE REGISTER MAP ------- */
    struct {
    CPU_REG16  GAFLIDLx;                                        /* Receive Rule Entry Register xAL. [ID     Register]   */
    CPU_REG16  GAFLIDHx;                                        /* Receive Rule Entry Register xAH. [ID     Register]   */
    CPU_REG16  GAFLMLx;                                         /* Receive Rule Entry Register xBL. [Mask   Register]   */
    CPU_REG16  GAFLMHx;                                         /* Receive Rule Entry Register xBH. [Mask   Register]   */
    CPU_REG16  GAFLPLx;                                         /* Receive Rule Entry Register xCL. [Config Register]   */
    CPU_REG16  GAFLPHx;                                         /* Receive Rule Entry Register xCH. [Config Register]   */
    } RX_RULE[16u];
} RX200_CAN_RR_REG;


